#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.PLR_CONF.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=moh_applications/client/c0fe2e9f-6937-4ffa-9296-d786d9b0a98b/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/68933fe3-7eb8-44d8-b020-beeb54fade3d]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_CONF.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=moh_applications/client/c0fe2e9f-6937-4ffa-9296-d786d9b0a98b/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/8bea7469-b2b6-4799-b914-91ee2221a15a]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-sat-eforms"]: Refreshing state... [id=moh_applications/client/55c07ad0-ac04-4eed-b98a-85aa8551163f/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/97ff8eb9-f5e0-4b09-88c1-bccb468f8376]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_CONF.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-plr_conf"]: Refreshing state... [id=moh_applications/client/c0fe2e9f-6937-4ffa-9296-d786d9b0a98b/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/db8e9223-4a9e-4700-bbd9-2f7ac047790a]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-user-roles"]: Refreshing state... [id=moh_applications/client/55c07ad0-ac04-4eed-b98a-85aa8551163f/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/06799768-828d-4299-832b-0cc7a56684b0]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/manage-user-details"]: Refreshing state... [id=moh_applications/client/55c07ad0-ac04-4eed-b98a-85aa8551163f/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/55179234-d6b5-4549-9e21-159bc9800425]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-uci-sso"]: Refreshing state... [id=moh_applications/client/55c07ad0-ac04-4eed-b98a-85aa8551163f/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/1b50472d-18cb-4587-894f-3bebca5c0a59]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=moh_applications/client/55c07ad0-ac04-4eed-b98a-85aa8551163f/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/8bea7469-b2b6-4799-b914-91ee2221a15a]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-hcimweb_huat"]: Refreshing state... [id=moh_applications/client/55c07ad0-ac04-4eed-b98a-85aa8551163f/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/9130f6c7-1d49-4f21-8a18-0db979ca1eb6]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-pidp-service"]: Refreshing state... [id=moh_applications/client/55c07ad0-ac04-4eed-b98a-85aa8551163f/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/c17c7bec-1945-45fc-a294-5c59a05afd30]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/create-user"]: Refreshing state... [id=moh_applications/client/55c07ad0-ac04-4eed-b98a-85aa8551163f/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/cda7bc35-a61c-4822-b0cb-0c45ebe626cc]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-SERVICE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=moh_applications/client/55c07ad0-ac04-4eed-b98a-85aa8551163f/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/68933fe3-7eb8-44d8-b020-beeb54fade3d]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_REV.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-client-plr_rev"]: Refreshing state... [id=ebde44cc-3cf7-40c2-ac32-dc3f70b91ab4/f8778dbf-d583-41f0-8208-99ebc9567ad7]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_REV.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=ebde44cc-3cf7-40c2-ac32-dc3f70b91ab4/68933fe3-7eb8-44d8-b020-beeb54fade3d]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_REV.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=ebde44cc-3cf7-40c2-ac32-dc3f70b91ab4/8bea7469-b2b6-4799-b914-91ee2221a15a]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_REV.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["realm-management/view-users"]: Refreshing state... [id=ebde44cc-3cf7-40c2-ac32-dc3f70b91ab4/5a35e168-27ad-4fc4-a574-e81ada1cc9be]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_UAT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-users"]: Refreshing state... [id=moh_applications/client/045f3224-9637-4785-a661-fc6f028804d2/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/8bea7469-b2b6-4799-b914-91ee2221a15a]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_UAT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-clients"]: Refreshing state... [id=moh_applications/client/045f3224-9637-4785-a661-fc6f028804d2/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/68933fe3-7eb8-44d8-b020-beeb54fade3d]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR_UAT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-plr_uat"]: Refreshing state... [id=moh_applications/client/045f3224-9637-4785-a661-fc6f028804d2/scope-mappings/ab6e0d99-9205-4625-8ea4-88835ddd36ae/84222c92-8abf-4021-abea-047cd461ae21]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/65d6f8b7-0703-46ed-9ced-55457bd6c14b]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/9dbc8e8b-0e25-44cd-bd1b-34a1846ac269]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/7f31f194-bfcc-43fd-babe-bc9545292ede]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_amh_demo"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/f3d5d424-88cb-472f-a0b9-b99cc342f40f]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/f2d7cc73-3c77-44e0-b6fb-cec2ea545629/a94bec86-0808-4f71-a947-b2049afc7d7e]
module.KEYCLOAK_DEV.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/0a4aed42-f8c1-4004-8218-dc92b231dd70/scope-mappings/2e52bc4c-f321-4bff-98d8-8ce89cd3e2e7/22f2f067-d74a-4108-bf1a-eb6bffd71736]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_amh_demo"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/c887cf6e-ee42-4807-a8b5-77b6c46fe218]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/86ec4f91-45fb-4e65-ae4f-e1b952fd4e47]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/60dfb3b9-5ceb-4498-a24c-9641796bd991/43bf4fca-777a-4c9c-9127-f9677c654fef]
module.KEYCLOAK_PROD.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/8021d870-8e65-46a4-8cef-40a3639edaac/scope-mappings/c55eb420-fd84-41a8-b653-6e1b3e291519/7489c26e-77c8-47ad-9c07-a9bb97a37d91]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_pidp_demo"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/458dd0fd-a742-4df1-b3ef-56ac85d7d8a9]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["account/view-profile"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/f7e7a2f0-6e8c-4037-ae60-439017c25321/cada8e04-363d-4213-a77f-2991c3fa50a3]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/ADMIN"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/c043fe54-6899-4e2e-94b6-a85c0051b7ab]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/USER"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/1814fe67-a84e-4ca7-9bcc-656b02c64c98]
module.KEYCLOAK_TEST.module.moh_applications.module.PIDP-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PIDP-SERVICE/feature_amh_demo"]: Refreshing state... [id=moh_applications/client/1065e2c3-8280-4bce-a170-e7fe044b285e/scope-mappings/55c07ad0-ac04-4eed-b98a-85aa8551163f/3ab21315-dcb9-40fb-92e6-81b40759e8d6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_DEV.module.moh_applications.module.LDAP-API.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "LDAP-API"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Client created to send requests to Organizations API"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.LDAP-API.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["offline_access"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "offline_access"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.LDAP-API.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["uma_authorization"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "uma_authorization"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_DEV.module.moh_applications.module.LDAP-API.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["ORGANIZATIONS-API/get-org"] will be created
  + resource "keycloak_openid_client_service_account_role" "ROLE" {
      + client_id               = "e80136f5-76d2-4286-bde2-ea835b0e2b64"
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "get-org"
      + service_account_user_id = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*